W4D1/first_routes/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "'123@'"], ["name", "'Chris'"], ["created_at", "2017-10-23 22:28:16.857731"], ["updated_at", "2017-10-23 22:28:16.857731"]]

  def index
    # render plain: "I'm in the index action!"
    @users = User.all
---
SELECT "users".* FROM "users"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "'again@'"], ["updated_at", "2017-10-23 22:33:55.392951"], ["id", 13]]